NguyennQuangMinh/vi-xu-ly---pic16f877a/ytb phuong tung/video 4/giao tiep njut nhan voi led/giao tiep nut nhan voi led.X/giao tiep nut nhan voi led.c
/*
 * File:   giao tiep nut nhan voi led.c
 * Author: Nguy?nQuangMinh
 *
 * Created on April 6, 2023, 4:31 PM
 */



// PIC16F887 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = OFF      // RE3/MCLR pin function select bit (RE3/MCLR pin function is digital input, MCLR internally tied to VDD)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = ON       // Brown Out Reset Selection bits (BOR enabled)
#pragma config IESO = OFF       // Internal External Switchover bit (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is disabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <math.h>
#define _XTAL_FREQ 4000000

unsigned char i , j;
unsigned char led[]={ 0x80 ,0x40 , 0x20 , 0x10 , 0x08 , 0x04 ,  0x02 , 0x01 };

void ledsangduoi( unsigned int n)
{
    while(n--)
    {
        for(i=0;i<8;i++)
        {
            PORTD =led[i];
            __delay_ms(500);
        }
        PORTD =0x00;
    }
}

void ledsangdan (unsigned int n)
{
    unsigned  b = 0x01;
    while (n--)
    {
        PORTD=0x00;
        __delay_ms(500);
        PORTD=b;
        for(i=0;i<8;i++)
        {
            b |= (b<< 1);
            PORTD=b;
            __delay_ms(500);
        }
        PORTD = 0x00;
    }
}

void ledsangdon(unsigned int n)
{
    unsigned char a = 0x00;
    while(n--)
    {
        for(i=0;i<8;i++)
        {
            for(j=0;j<8-i;j++)
            {
                PORTD=(0x80>>j)|a;
                __delay_ms(200);
            }
            a = PORTD;
            __delay_ms(200);
        }
        PORTD=0x00;
    }
}

void main(void) {
    ANSEL = ANSELH =0x00;
    TRISB0=1;
    TRISB1=1;
    nRBPU=0;
    WPUB0=1;
    WPUB1=1;
    TRISD=0x00;
    PORTD=0x00;
    
    
    while(1)
    {
        if(RB0==0 )
        {
            __delay_ms(10);
//            PORTD=0xFF;
//            __delay_ms(10);
            while(RB0==0)
            {
                ledsangduoi(1);
            }
        }
        if(RB1==0)
        {
            __delay_ms(10);
//            PORTD=0x00;
//            __delay_ms(10);
            while(RB1==0)
            {
                ledsangdan(1);
            }
        }
        if(RB2==0)
        {
            __delay_ms(10);
//            PORTD=0x00;
//            __delay_ms(10);
            while(RB2==0)
            {
                ledsangdon(1);
            }
        }
    }
}
